*>*******************************************
*>                                          *
*>  File Definition For The Open Item File  *
*>         Sales                            *
*>*******************************************
*> 114 bytes 09/03/09
*>
 fd  open-item-file-s.
*>
 01  open-item-record-s     pic x(114).
