*>
     select  del-inv-nos-file  assign        file-17
                               access        sequential
                               status        fs-reply.
