*>
     select  open-item-file-3  assign        file-19
                               access        dynamic
                               organization  indexed
                               status        fs-reply
                               record key    oi3-key.
