*>
     select  invoice-file    assign        file-16
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    invoice-key.
