*>*******************************************
*>                                          *
*>  File Definition For The Open Item File  *
*>      Purchase                            *
*>*******************************************
*> 109 bytes 26/03/09
*>
 fd  open-item-file-s.
*>
 01  open-item-record-s     pic x(109).
*>
