*>
     select  del-inv-nos-file  assign        file-23
                               access        sequential
                               status        fs-reply.
