*>
     select  pay-file        assign        file-32
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    pay-key.
