*>
     select  ledger-file     assign        file-5
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    ledger-key.
