     select optional irs-post-file  assign file-8
                                    organization sequential
                                    status fs-reply.
