     select  irs-post-file   assign "postings2irs.dat"
                             organization sequential
                             status fs-reply.
