*>*******************************************
*>                                          *
*>  Working Storage for the Defaults File   *
*>                                          *
*>*******************************************
*> rec 256 byytes 15/02/09
*>
 01  default-record.
     03  def-acs         pic 9(5)   occurs  32.
     03  def-codes       pic xx     occurs  32.
     03  def-vat         pic x      occurs  32.
*>
