*>*******************************************
*>                                          *
*>  File Definition For The Open Item File  *
*>                                          *
*>*******************************************
*>  size 109 26/03/09
 fd  open-item-file-4.
*>
 01  open-item-record-4  pic x(109).
