*>
     select  posting-file    assign        file-6
                             access        dynamic
                             organization  is relative
                             relative key  is rrn
                             status        fs-reply.
