 01  ws-calling-data.
     03  ws-called       pic x(8).
     03  ws-caller       pic x(8).
     03  ws-del-link     pic x(8).
     03  ws-term-code    pic 9.
*>                                 new 18/5/13
     03  ws-Process-Func pic 9.
     03  ws-Sub-Function pic 9.
     03  filler          pic x.
*>
